# ConvertUserVisiblePathToModelPath Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelPathUtils..::..ConvertUserVisiblePathToModelPath Method
ModelPathUtils Class See Also
---
Converts a user-visible path (string) to a ModelPath.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static ModelPath ConvertUserVisiblePathToModelPath(
	string strPath
)
```

Visual Basic
---
```text
Public Shared Function ConvertUserVisiblePathToModelPath ( _
	strPath As String _
) As ModelPath
```

Visual C++
---
```text
public:
static ModelPath^ ConvertUserVisiblePathToModelPath(
	String^ strPath
)
```

# ### Parameters
strPath
    Type: System..::..String The path in string form, like RSN://{HostNodeName}/school/project.rvt
# ### Return Value
A ModelPath representing either a server or file path.
# Remarks
The path may be a server or file path.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ModelPathUtils Class
Autodesk.Revit.DB Namespace